In [1]:
import pandas as pd

In [4]:
x = [1,2,3]

In [6]:
var  = pd.Series(x)

In [7]:
var

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series([[1,2,3],[4,5,6]])

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [9]:
print(type(var))

<class 'pandas.core.series.Series'>

In [10]:
# now we will chaneg index of the pandas seris

In [19]:
var = pd.Series(x,index=['A','B','c'])  # the length of te obect in the series and the length of the object in index should be equal

In [20]:
var

A    1
B    2
c    3
dtype: int64

In [21]:
# now we will data type of series data

In [22]:
var = pd.Series(x,index=['A','B','C'],dtype=float)

In [23]:
var

A    1.0
B    2.0
C    3.0
dtype: float64

In [24]:
# now we will use name parameter to give name to our database

In [25]:
var  = pd.Series(x,index=['A','B','C'],dtype=float,name='python')

In [26]:
var

A    1.0
B    2.0
C    3.0
Name: python, dtype: float64

In [27]:
# now we can create series using datatype list,dictionary,tuple anything

In [28]:
# for example

In [29]:
# using dictionary

In [103]:
dict={'name':["anuj","akhil","ANkush","VINIT"],
       'parity':[12,1,31,34],
       'rank':[1,2,3,4]}

In [104]:
pd.Series(dict) # when we use dictionary keys become the heading

name      [anuj, akhil, ANkush, VINIT]
parity                 [12, 1, 31, 34]
rank                      [1, 2, 3, 4]
dtype: object

In [33]:
#now we will use tuple for that thing

In [34]:
tuple = 'six','seven','eight'

In [35]:
pd.Series(tuple)

0      six
1    seven
2    eight
dtype: object

In [36]:
#now we will cretae series from simple thing

In [43]:
pd.Series(12)

0    12
dtype: int64

In [44]:
s2 = pd.Series(12,index=[1,2,3,4,5,6])  # it will create same number of values equal to index

In [45]:

s1 = pd.Series(13,index=[1,2,3,4,5])

In [47]:
print(s1+s2) # it will do the sum upto the matching index number after that nan will be showed

1    25.0
2    25.0
3    25.0
4    25.0
5    25.0
6     NaN
dtype: float64

In [48]:
# now we will about dataframe

In [52]:
q = [10,11,12,13,14]

In [53]:
var1 = pd.DataFrame(q)

In [54]:
var1

    0
0  10
1  11
2  12
3  13
4  14

In [57]:
var2 = pd.DataFrame([[1,2,3],[10,11,12],[13,14,15,16]])  # each list becomes a coloumn and element of list corresponds to index

In [58]:
var2

    0   1   2     3
0   1   2   3   NaN
1  10  11  12   NaN
2  13  14  15  16.0

In [59]:
# create dataframe using dctionary

In [64]:
dict1 = {'a':[1,2,3,4,5],'b':[1,2,3,4,5]}  # the values should of same length here key corresponds to coloumn

In [65]:
pd.DataFrame(dict1)

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [66]:
# to access a specific coloumn

In [70]:
var3 = pd.DataFrame(dict1,columns=['a'])  # calling a specific coloumn

In [71]:
var3

   a
0  1
1  2
2  3
3  4
4  5

In [72]:
# to change the index

In [77]:
var4 = pd.DataFrame(dict1,columns=['b'],index=['a','b','c','d','e'])

In [79]:
var4  # here we have accessed a particular colomn and changed it index

   b
a  1
b  2
c  3
d  4
e  5

In [80]:
# ow accesiing a particular value

In [84]:
print(var3["a"][3])

4

In [85]:
# create a list using multiple list

In [89]:
list_1 =[['a','b','c','d'],['p','q','r','s','x']]  # data hamesha serially hi bharega coloumns

In [90]:
pd.DataFrame(list_1)

   0  1  2  3     4
0  a  b  c  d  None
1  p  q  r  s     x

In [91]:
#complex pandas

In [98]:
s = {"s":pd.Series([1,2,3,4]),"f":pd.Series([10,11,12,13,15])}

In [99]:
pd.DataFrame(s)

     s   f
0  1.0  10
1  2.0  11
2  3.0  12
3  4.0  13
4  NaN  15

In [100]:
#arithmatic operators on pandas